brew "azure-cli"
brew "cask"
brew "cocoapods"
brew "gh"
brew "git"
brew "git-lfs"
brew "mupdf"
brew "openjdk"
brew "pdfcpu"
brew "poppler"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "rye"
brew "starship"
brew "uv"
brew "wireguard-tools"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "adobe-acrobat-reader"
cask "android-studio"
cask "bruno"
cask "claude"
cask "claude-code"
cask "cloudflare-warp"
cask "coteditor"
cask "devtoys"
cask "discord"
cask "docker-desktop"
cask "drawio"
cask "ferdium"
cask "figma"
cask "flutter"
cask "google-chrome"
cask "home-assistant"
cask "iterm2"
cask "karabiner-elements"
cask "knime"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "onedrive"
cask "postman"
cask "pycharm"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "zotero"
vscode "anthropic.claude-code"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "docker.docker"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
